In [1]:
import pandas as pd
import numpy as np

In [4]:
d={
    'name':['Bhanu','bharat','Akhil'],
    'place':['Marehra','Rajasthan',np.nan],
    'spi':[9.63,np.nan,8.6]
}
df=pd.DataFrame(d)
df

     name      place   spi
0   Bhanu    Marehra  9.63
1  bharat  Rajasthan   NaN
2   Akhil        NaN  8.60

In [5]:
df.isnull()

    name  place    spi
0  False  False  False
1  False  False   True
2  False   True  False

In [7]:
df.isnull().sum()

name     0
place    1
spi      1
dtype: int64

In [8]:
df.isna().sum()

name     0
place    1
spi      1
dtype: int64

In [13]:
df.dropna(axis='index',how='all')

     name      place   spi
0   Bhanu    Marehra  9.63
1  bharat  Rajasthan   NaN
2   Akhil        NaN  8.60

In [15]:
#to take the transpose we use .T
#only for the numeric columns
df.describe().T

     count   mean      std  min     25%    50%     75%   max
spi    2.0  9.115  0.72832  8.6  8.8575  9.115  9.3725  9.63

In [17]:
df['spi'].max()

9.63

In [18]:
filt = df['spi']>9.00
df[filt]

    name    place   spi
0  Bhanu  Marehra  9.63

In [19]:
df

     name      place   spi
0   Bhanu    Marehra  9.63
1  bharat  Rajasthan   NaN
2   Akhil        NaN  8.60

In [22]:
df.fillna(0,inplace=True)
df

     name      place   spi
0   Bhanu    Marehra  9.63
1  bharat  Rajasthan  0.00
2   Akhil          0  8.60

In [23]:
df['spi'].mean()

6.076666666666667

In [26]:
df.sort_values(by='spi',ascending=True)

     name      place   spi
1  bharat  Rajasthan  0.00
2   Akhil          0  8.60
0   Bhanu    Marehra  9.63

In [27]:
df.reset_index()

   index    name      place   spi
0      0   Bhanu    Marehra  9.63
1      1  bharat  Rajasthan  0.00
2      2   Akhil          0  8.60